src/cf/AccumulationRegisters/Запасы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Запасы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоИнт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаИнт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДСИнт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КоррСтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррХарактеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррПартия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Спецификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСпецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Спецификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМВозврат</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПересортицаЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксированнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗатратыНаВыпуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеПроводки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеремещениеВРозницуСуммовойУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррЗаказНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДвижениеЧекаВОткрытойСмене</Name>
					<Comment>Для изолирования движений по оперативному проведению Чеков ККМ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/ДвиженияСерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ДвиженияСерииНоменклатуры</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОперацииСерийНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/ТипыПолитикУказанияСерий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыПолитикУказанияСерий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СправочноеУказаниеСерий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвторасчетОстатковСерий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеОстаткамиСерий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/СерииНоменклатурыУНФВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция - Коэффициент единицы
//
// Параметры:
//  ЕдиницаИзмерения - СправочникСсылка.ЕдиницыИзмерения
// 
// Возвращаемое значение:
//  Число - Коэффициент пересчета в базовую единицу измерения номенклатурной позиции
//
Функция КоэффициентЕдиницы(ЕдиницаИзмерения) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЕдиницаИзмерения, "Коэффициент");
	
КонецФункции

// Возвращает признак возможности изменения использования серий
//
// Параметры:
//  НоменклатураВладелец - СправочникСсылка.Номенклатура
//  ИзКатегории - Булево - Политика учета серий берется из категории номенклатуры
//
// Возвращаемое значение:
//  Булево - Ппризнак возможности изменения серий.
//
Функция ИзменениеИспользованияСерийПоНоменклатуреВозможно(НоменклатураВладелец, НастройкаИспользованияСерий = Неопределено, КатегорияНоменклатуры = Неопределено) Экспорт
	
	СтруктураВозврата = Новый Структура("ОтказПоДвижениямПоСериям, ОтказПоПолитике, ОтказПоНастройкамСерий", Ложь, Ложь, Ложь);
	
	КатегорияНоменклатурыИзСсылки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатураВладелец,
		"КатегорияНоменклатуры");
	ИспользоватьСерииИзКатегорииВКатегорииИзСсылки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КатегорияНоменклатурыИзСсылки,
		"ИспользоватьСерииИзКатегории");

	
	// Когда категорию меняют в номенклатуре
	Если Не КатегорияНоменклатуры = Неопределено Тогда
		
		ИспользоватьСерииИзКатегории = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КатегорияНоменклатуры, "ИспользоватьСерииИзКатегории");
		
		Если ИспользоватьСерииИзКатегории И НастройкаИспользованияСерий = "Индивидуальные" Тогда
		СтруктураВозврата.ОтказПоНастройкамСерий = Истина;
			Возврат СтруктураВозврата;
		КонецЕсли;
		
	КонецЕсли;
	
	// Когда меняют настройку использования серий на индивидуальные
	Если ИспользоватьСерииИзКатегорииВКатегорииИзСсылки И НастройкаИспользованияСерий = "Индивидуальные" Тогда
		СтруктураВозврата.ОтказПоНастройкамСерий = Истина;
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	ПолитикаИзКатегорииУправлениеОстатками = Ложь;
	
	ИзКатегории = НастройкаИспользованияСерий = "ИзКатегории";
	Если ИзКатегории Тогда

		ПолитикаУчетаСерий = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КатегорияНоменклатурыИзСсылки,
			"ПолитикаУчетаСерий");
		ТипПолитики = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПолитикаУчетаСерий,
			"ТипПолитики");

		ПолитикаИзКатегорииУправлениеОстатками = ТипПолитики = Перечисления.ТипыПолитикУказанияСерий.УправлениеОстаткамиСерий;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Номенклатура", НоменклатураВладелец);
	
	Если ПолитикаИзКатегорииУправлениеОстатками Тогда

		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Запасы.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрНакопления.Запасы КАК Запасы
		|ГДЕ
		|	Запасы.Номенклатура = &Номенклатура";

		Если Не Запрос.Выполнить().Пустой() Тогда
			СтруктураВозврата.ОтказПоПолитике = Истина;
		КонецЕсли;

	Иначе

		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДвиженияСерииНоменклатуры.Серия КАК Серия
		|ИЗ
		|	РегистрНакопления.ДвиженияСерииНоменклатуры КАК ДвиженияСерииНоменклатуры
		|ГДЕ
		|	ДвиженияСерииНоменклатуры.Номенклатура = &Номенклатура
		|	И НЕ ДвиженияСерииНоменклатуры.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)";

		Если Не Запрос.Выполнить().Пустой() Тогда
			СтруктураВозврата.ОтказПоДвижениямПоСериям = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
		
КонецФункции

// Возвращает признак возможности изменения использования серий по категории
//
// Параметры:
//  КатегорияВладелец - СправочникСсылка.КатегорииНоменклатуры
//  НастройкаИспользованияСерий - Строка - Строковое обозначение настройки
//
// Возвращаемое значение:
//  Булево - Ппризнак возможности изменения серий.
//
Функция ИзменениеИспользованияСерийПоКатегоииВозможно(КатегорияВладелец, НастройкаИспользованияСерий) Экспорт
	
	СтруктураВозврата = Новый Структура("ОтказПоДвижениямПоСериям, ОтказПоНастройкамСерийОбщиеПоКатегории, ОтказПоНастройкамСерийИндивидуальные", Ложь, Ложь, Ложь);
	
	Запрос = Новый Запрос;
	
	Если НастройкаИспользованияСерий = "ИзКатегории" Тогда
		
		Запрос.УстановитьПараметр("Категория", КатегорияВладелец);
		
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.КатегорияНоменклатуры = &Категория
		|	И Номенклатура.ИспользоватьСерииНоменклатуры
		|	И НЕ Номенклатура.ИспользоватьСерииИзКатегории";
		
		СтруктураВозврата.ОтказПоНастройкамСерийОбщиеПоКатегории = Не Запрос.Выполнить().Пустой();
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	Если НастройкаИспользованияСерий = "Индивидуальные" Тогда
		
		Запрос.УстановитьПараметр("Категория", КатегорияВладелец);
		
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.КатегорияНоменклатуры = &Категория
		|	И Номенклатура.ИспользоватьСерииНоменклатуры
		|	И Номенклатура.ИспользоватьСерииИзКатегории";
		
		СтруктураВозврата.ОтказПоНастройкамСерийИндивидуальные = Не Запрос.Выполнить().Пустой();
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Категория", КатегорияВладелец);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДвиженияСерииНоменклатуры.Серия КАК Серия
	|ИЗ
	|	РегистрНакопления.ДвиженияСерииНоменклатуры КАК ДвиженияСерииНоменклатуры
	|ГДЕ
	|	НЕ ДвиженияСерииНоменклатуры.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	И ДвиженияСерииНоменклатуры.Серия.Владелец = &Категория";
	
	СтруктураВозврата.ОтказПоДвижениямПоСериям = Не Запрос.Выполнить().Пустой();
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти
